app/controllers/notes_controller.rb

INSERT INTO "notes" ("contents", "created_at", "pinned", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["contents", "asdfasdf"], ["created_at", Sun, 07 Apr 2013 00:51:53 UTC +00:00], ["pinned", false], ["updated_at", Sun, 07 Apr 2013 00:51:53 UTC +00:00], ["user_id", 1]]
---
  def create
    @note = current_user.notes.create(params[:note])

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "45"]]
UPDATE "notes" SET "contents" = 'hey there', "updated_at" = '2013-04-07 23:37:13.555115' WHERE "notes"."id" = 49
---
  def update
    @note = Note.find(params[:id])
    # TODO: this is not very secure
    @hashtags = current_user.unique_hashtags

    respond_to do |format|
      if @note.update_attributes(params[:note])